package com.perullheim.homework

class GeoDict {
    companion object {
        val base20: Map<Int, String> = mapOf(
            1 to "ერთი",
            2 to "ორი",
            3 to "სამი",
            4 to "ოთხი",
            5 to "ხუთი",
            6 to "ექვსი",
            7 to "შვიდი",
            8 to "რვა",
            9 to "ცხრა",
            10 to "ათი",
            11 to "თერთმეტი",
            12 to "თორმეტი",
            13 to "ცამეტი",
            14 to "თოთხმეტი",
            15 to "თხუთმეტი",
            16 to "თექვსმეტი",
            17 to "ჩვიდმეტი",
            18 to "თვრამეტი",
            19 to "ცხრამეტი"
        )

        val base1000: Map<Int, String> = mapOf(
            3 to "ათასი",
            6 to "მილიონი",
            9 to "მილიარდი",
            12 to "ტრილიონი",
            15 to "კვადრილიონი",
            18 to "კვინტილიონი",
            21 to "სექსტილიონი",
            24 to "სეპტილიონი",
            27 to "ოქტილიონი",
            30 to "ნონილიონი",
            33 to "დესილიონი",
            36 to "ჰენდეცილიონი",
            39 to "დოდეცილიონი",
            42 to "ტრიდეცილიონი",
            45 to "კვარტადეცილიონი"
        )
    }
}